; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v7)
		(pred_6 ?v1)
		(pred_3 ?v6)
		(pred_2 ?v6)
		(pred_4 ?v1 ?v6)
		(pred_5)
		(pred_1 ?v1))

   (:action op_3
       :parameters  (?v8 ?v5)
       :precondition (and (not-eq ?v8 ?v5) 
                          (pred_3 ?v8) (pred_3 ?v5) (pred_2 ?v8))
       :effect (and  (pred_2 ?v5)
		     (not (pred_2 ?v8))))


   (:action op_1
       :parameters (?v3 ?v4)
       :precondition  (and  (pred_6 ?v3) (pred_3 ?v4)
			    (pred_4 ?v3 ?v4) (pred_2 ?v4) (pred_5))
       :effect (and (pred_1 ?v3)
		    (not (pred_4 ?v3 ?v4)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v3  ?v4)
       :precondition  (and  (pred_6 ?v3) (pred_3 ?v4)
			    (pred_1 ?v3) (pred_2 ?v4))
       :effect (and (pred_4 ?v3 ?v4)
		    (pred_5)
		    (not (pred_1 ?v3)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_01 obj_04 
          obj_05 obj_02 
)
(:init
(pred_3 obj_03)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_6 obj_05)
(pred_6 obj_02)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_5)
(pred_4 obj_05 obj_03)
(pred_4 obj_02 obj_03)
(pred_2 obj_03)
)
(:goal
(and
(pred_4 obj_05 obj_04)
(pred_4 obj_02 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_05 obj_04) (pred_2 obj_01))
    (sometime-before  (pred_4 obj_02 obj_01) (pred_2 obj_04))
  )
)
)

; plan
1. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_05 obj_03) (pred_5)
   added: (pred_1 obj_05)
   goals met: 0 of 2
2. (op_3 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 0 of 2
3. (op_3 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 0 of 2
4. (op_2 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_4 obj_05 obj_04) (pred_5)
   goals met: 1 of 2
5. (op_3 obj_04 obj_03)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_03)
   goals met: 1 of 2
6. (op_1 obj_02 obj_03)
   deleted: (pred_4 obj_02 obj_03) (pred_5)
   added: (pred_1 obj_02)
   goals met: 1 of 2
7. (op_3 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 1 of 2
8. (op_2 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_4 obj_02 obj_01) (pred_5)
   goals met: 2 of 2
